# Text Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ModelText..::..Text Property
ModelText Class See Also
---
The text string in the model text.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string Text { get; set; }
```

Visual Basic
---
```text
Public Property Text As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ Text {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when nullNothingnullptra null reference (Nothing in Visual Basic) is assigned to text. |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when an empty string is assigned to text. |

# See Also
ModelText Class
Autodesk.Revit.DB Namespace